<a href="https://colab.research.google.com/github/runeking2006/vac_1/blob/main/1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1

In [ ]:
import pandas as pd
import numpy as np

data={
    'Age':[25,30,np.nan,35,40],
    'Salary':[50000,60000,np.nan,75000,80000],
    'Gender':['Male','Female','Male','Female',np.nan]
}

In [ ]:
df = pd.DataFrame(data)
print("Original DataFrame with missing values:")
print(df)

Original DataFrame with missing values:
    Age   Salary  Gender
0  25.0  50000.0    Male
1  30.0  60000.0  Female
2   NaN      NaN    Male
3  35.0  75000.0  Female
4  40.0  80000.0     NaN

In [ ]:
print("\nMissing values in each column:")
print(df.isnull().sum())

Missing values in each column:
Age       1
Salary    1
Gender    1
dtype: int64

In [ ]:
numerical_cols = ['Age', 'Salary']
for col in numerical_cols:
    mean_value = df[col].mean()
    df[col].fillna(mean_value, inplace=True)

print("DataFrame after imputing missing numerical values with column means:")
print(df)

DataFrame after imputing missing numerical values with column means:
    Age   Salary  Gender
0  25.0  50000.0    Male
1  30.0  60000.0  Female
2  32.5  66250.0    Male
3  35.0  75000.0  Female
4  40.0  80000.0     NaN

/tmp/ipython-input-4256637113.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(mean_value, inplace=True)

In [ ]:
categorical_cols = ['Gender']
for col in categorical_cols:
    mode_value = df[col].mode()[0]  # Get the first mode if there are multiple
    df[col] = df[col].fillna(mode_value)

print("DataFrame after imputing missing categorical values with column modes:")
print(df)

DataFrame after imputing missing categorical values with column modes:
    Age   Salary  Gender
0  25.0  50000.0    Male
1  30.0  60000.0  Female
2  32.5  66250.0    Male
3  35.0  75000.0  Female
4  40.0  80000.0  Female

In [ ]:
print("Final DataFrame:")
print(df)

Final DataFrame:
    Age   Salary  Gender
0  25.0  50000.0    Male
1  30.0  60000.0  Female
2  32.5  66250.0    Male
3  35.0  75000.0  Female
4  40.0  80000.0  Female

ANALYSIS-1

In [16]:
data=pd.read_csv("/content/drive/MyDrive/used_cars_data.csv")

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7253 entries, 0 to 7252
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   S.No.              7253 non-null   int64
 1   Name               7253 non-null   object
 2   Location           7253 non-null   object
 3   Year               7253 non-null   int64
 4   Kilometers_Driven  7253 non-null   int64
 5   Fuel_Type          7253 non-null   object
 6   Transmission       7253 non-null   object
 7   Owner_Type         7253 non-null   object
 8   Mileage            7251 non-null   object
 9   Engine             7207 non-null   object
 10  Power              7207 non-null   object
 11  Seats              7200 non-null   float64
 12  New_Price          1006 non-null   object
 13  Price              6019 non-null   float64
dtypes: float64(2), int64(3), object(9)
memory usage: 793.4+ KB